УНФ_ТЕСТ/src/InformationRegisters/КП_РецензииКонтролеров/КП_РецензииКонтролеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КП_РецензииКонтролеров</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТекстРецензии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезультатОдобрен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>БизнесПроцесс</name>
    <type>
      <types>BusinessProcessRef.КП_БизнесПроцесс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаКБП</name>
    <type>
      <types>CatalogRef.КП_ТочкиПроцессов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <comment>Если исполнитель не указан, то это итоговая рецензия на всю точку</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контролер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗадачаИсполнителя</name>
    <type>
      <types>TaskRef.КП_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИднИсполнителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ/src/InformationRegisters/КП_РецензииКонтролеров/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Запись.Контролер<>Пользователи.ТекущийПользователь() Тогда
		Элементы.Период.ТолькоПросмотр=Истина;	
		Элементы.Исполнитель.ТолькоПросмотр=Истина;
		Элементы.Контролер.ТолькоПросмотр=Истина;
		Элементы.ТекстРецензии.ТолькоПросмотр=Истина;
		Элементы.РезультатОднобрено.ТолькоПросмотр=Истина;
		
		Элементы.ФормаЗаписатьИЗакрыть.Видимость=Ложь;
		Элементы.ФормаПеречитать.Видимость=Ложь;
		Элементы.ФормаЗаписать.Видимость=Ложь;
		
		Элементы.ФормаЗакрыть.КнопкаПоУмолчанию=Истина;
		
	КонецЕсли;
	
	РезультатОднобрено=?(Запись.РезультатОдобрен, 1, 2);
	
КонецПроцедуры
